app/views/mytickets/_form.html.erb

SELECT  "departaments".* FROM "departaments"  ORDER BY "departaments"."id" ASC LIMIT 1
---
    <div class="controls">
    <%= f.select :departament_id, Departament.all.map {|i| [i.title, i.id] }, :class => 'form-control' %>

SELECT "categories".* FROM "categories"
---
    <div class="controls">
    <%= f.select :category_id, Category.all.map {|i| [i.name, i.id] }, :class => 'form-control' %>