app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "departaments_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rryaq"], ["departaments_id", 1], ["created_at", "2015-06-30 08:26:36.356670"], ["updated_at", "2015-06-30 08:26:36.356670"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 4]]
---
  def destroy
    @category.destroy