app/controllers/departaments_controller.rb

  def index
    @departaments = Departament.all
---
SELECT "departaments".* FROM "departaments"

  def create
    @departament = Departament.new(departament_params)

    respond_to do |format|
      if @departament.save
---
INSERT INTO "departaments" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Departamento 1"], ["created_at", "2015-06-30 07:50:04.140938"], ["updated_at", "2015-06-30 07:50:04.140938"]]

    def set_departament
      @departament = Departament.find(params[:id])
---
SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = ? LIMIT 1  [["id", 1]]