app/controllers/mytickets_controller.rb

SELECT "mytickets".* FROM "mytickets"
---
  def index
    @mytickets = current_user.admin? ? Myticket.all : current_user.mytickets