app/views/categories/_form.html.erb

    <div class="controls">
    <%= f.select :departament_id, Departament.all.map {|i| [i.title, i.id] }, :class => 'form-control' %>
---
SELECT "departaments".* FROM "departaments"